[[ -z $1 || -z $2 ]] && echo "usage $0: input output" && exit 1
cat "$1" |sed -e s/\>//g -e s/\<//g -e s/\ \\.//g -e s/\\//\ /g -e s/–/\ /g -e s/«//g -e s/»//g |
sed -e s/\.,/,/g |
sed -e s/\ ,/,\ /g |
sed -e s/—/-/g |
sed -e s/…/\./g |
sed -e s/,-/\ /g |
sed -e 's/\.?/?/g' |
#sed -e s/\.\.\./\./g |
sed -e s/•//g -e s/“//g -e s/”//g |
sed 's/\([0-9]\),\([0-9]\)/\1\ и\ \2/g' |
sed 's/\([^$\.]\)\.\([^\ ]\)/\1\.\ \2/g' | # добавляет пробел после точек, если его не было
sed -e s/\"//g | # убираем нафиг кавычки
sed -e s/№/номер/g |
sed -e s/www\./ввв\ точка\ /g |
sed -e s/com\./\ точка\ ком/g |
sed -e s/\.ru/\ точка\ ру/g |
sed -e s/%/\ процентов/g -e s/т\\\.д/тд/g -e s/т\\\.п/тп/g -e s/т\\\.е\\\./то\ есть/g -e s/=/равно/g |
sed -e s/д\\\.н\\\.э\\\./до\ нашей\ эры/g -e s/н\\\.э\\\./нашей\ эры/g |
sed -e s/х\\\.ф\\\./художественный\ фильм/g |
sed -e s/\*/a/g |
# ударение
sed -e s/участвовавшим/уча+ствовавши+м/g |
sed -e s/Кэрролла/К+эрролла/g |
sed -e s/Крайону/Край+ону/g  > "$2"